Element is a built-in part of the family definition and cannot be deleted or added to groups.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotDeletePredefinedFamilyElement { get; }
  Visual Basic
Public Shared ReadOnly Property CannotDeletePredefinedFamilyElement As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotDeletePredefinedFamilyElement {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace